OpenFOAM-6-AP/tutorials/combustion/fireFoam/LES/oppositeBurningPanels/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    ground
    {
        type        compressible::alphatWallFunction;
        value       uniform 0;
    }

    top
    {
        type        zeroGradient;
    }

    burner
    {
        type        zeroGradient;
    }

    sides
    {
        type        zeroGradient;
    }

    "(region0_to.*)"
    {
        type        compressible::alphatWallFunction;
        value       uniform 0;
    }
}


// ************************************************************************* //
