OpenFOAM-6-AP/tutorials/combustion/fireFoam/LES/oppositeBurningPanels/0/panelRegion/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 298.15;

boundaryField
{

    ".*"
    {
        type            zeroGradient;
    }

    fRight_zone_side
    {
        type            wedge;
    }

    fLeft_zone_side
    {
        type            wedge;
    }

   "(region0_to.*)"
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        Tnbr            T;
        kappaMethod     solidThermo;
        qrNbr           qr;
        qr              none;
        value           uniform 298.15;
    }

}


// ************************************************************************* //
