OpenFOAM-6-AP/tutorials/combustion/fireFoam/LES/oppositeBurningPanels/0/panelRegion/qr
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      qr;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    ".*"
    {
        type            zeroGradient;
    }

    fRight_zone_side
    {
        type            wedge;
    }

    fLeft_zone_side
    {
        type            wedge;
    }

    region0_to_panelRegion_fLeft_zone
    {
        type            mappedField;
        sampleRegion    region0;
        sampleMode      nearestPatchFace;
        samplePatch     region0_to_panelRegion_fLeft_zone;
        offset          (0 0 0);
        field       qr;
        setAverage      no;
        average         0;
        value           uniform 0;
    }

    region0_to_panelRegion_fRight_zone
    {
        type            mappedField;
        sampleRegion    region0;
        sampleMode      nearestPatchFace;
        samplePatch     region0_to_panelRegion_fRight_zone;
        offset          (0 0 0);
        field       qr;
        setAverage      no;
        average         0;
        value           uniform 0;
    }
}


// ************************************************************************* //
